module.exports = {
  // Одинарные кавычки вместо двойных
  singleQuote: true,
  // Добавлять запятые в конце многоточий
  trailingComma: 'all',
  // Выравнивать код по ширине строки
  printWidth: 80,
  // Вставлять точку с запятой в конце каждой строки
  semi: true,
  // Расставлять пробелы внутри фигурных скобок
  bracketSpacing: true,
  // Вставлять пробелы перед и после JSX-тегов
  jsxBracketSameLine: false,
  // Вставлять пробел перед закрывающим `>`, когда есть текст внутри JSX-элементов
  jsxSingleQuote: false,
  // Определять форматирование кода в `<pre>` элементах
  htmlWhitespaceSensitivity: 'css',
  // Вставлять пробелы вокруг стрелок в функциях, если это необходимо
  arrowParens: 'always',
};
